fonecmid-diplom/src/DataProcessors/ВКМ_МассовоеСозданиеАктов/ВКМ_МассовоеСозданиеАктов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ВКМ_МассовоеСозданиеАктов</name>
  <attributes>
    <name>Период</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Договоры</name>
    <attributes>
      <name>Договор</name>
      <type>
        <types>CatalogRef.ДоговорыКонтрагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>Реализация</name>
      <type>
        <types>DocumentRef.РеализацияТоваровУслуг</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

fonecmid-diplom/src/Documents/РеализацияТоваровУслуг/РеализацияТоваровУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РеализацияТоваровУслуг</name>
  <registerRecords>AccumulationRegister.ОстаткиТоваров</registerRecords>
  <registerRecords>AccumulationRegister.ОбработкаЗаказов</registerRecords>
  <registerRecords>AccumulationRegister.ВКМ_ВыставленныеУслуги</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Услуги</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/DataProcessors/ВКМ_МассовоеСозданиеАктов/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Создаёт и проводит акты (реализации товаров и услуг) по абонентским договорам за месяц периода.
// Если за месяц по договору реализация уже есть, новая не создаётся.
// Предназначена для выполнения как длительная операция.
//
// Параметры:
//  Период   - Дата - любая дата месяца, за который создаются акты.
//  Договоры - Массив из СправочникСсылка.ДоговорыКонтрагентов - договоры, по которым создаются акты.
//
// Возвращаемое значение:
//  Соответствие из КлючИЗначение:
//   * Ключ     - СправочникСсылка.ДоговорыКонтрагентов
//   * Значение - Структура:
//     ** Реализация - ДокументСсылка.РеализацияТоваровУслуг
//     ** Ошибка     - Строка
Функция СоздатьАкты(Период, Договоры) Экспорт
	
	Результат = Новый Соответствие;
	Всего = Договоры.Количество();
	Если Всего = 0 Тогда
		Возврат Результат;
	КонецЕсли;
	
	РеквизитыДоговоров = РеквизитыДоговоров(Договоры);
	СуществующиеАкты = СуществующиеАкты(Период, Договоры);
	Номер = 0;
	
	Для Каждого Договор Из Договоры Цикл
		Номер = Номер + 1;
		ДлительныеОперации.СообщитьПрогресс(Номер * 100 / Всего,
			СтрШаблон(НСтр("ru = 'Обработано договоров: %1 из %2'"), Номер, Всего));
		
		Реализация = СуществующиеАкты.Получить(Договор);
		Ошибка = "";
		
		Если Реализация = Неопределено Тогда
			Попытка
				// @skip-check query-in-loop - документ создаётся и проводится отдельно по каждому договору
				Реализация = СоздатьАкт(Период, Договор, РеквизитыДоговоров.Получить(Договор));
			Исключение
				Ошибка = ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
			КонецПопытки;
		КонецЕсли;
		
		Результат.Вставить(Договор, Новый Структура("Реализация, Ошибка", Реализация, Ошибка));
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция СоздатьАкт(Период, Договор, РеквизитыДоговора)
	
	Если РеквизитыДоговора = Неопределено Тогда
		ВызватьИсключение НСтр("ru = 'Договор не найден.'");
	КонецЕсли;
	
	НачатьТранзакцию();
	Попытка
		Документ = Документы.РеализацияТоваровУслуг.СоздатьДокумент();
		// Стандартный алгоритм заполнения.
		Документ.Заполнить(Неопределено);
		Документ.Дата = КонецМесяца(Период);
		Документ.Организация = РеквизитыДоговора.Организация;
		Документ.Контрагент = РеквизитыДоговора.Контрагент;
		Документ.Договор = Договор;
		Документ.ВКМ_ВыполнитьАвтозаполнение();
		
		// Стандартный алгоритм проверки заполнения.
		Если Не Документ.ПроверитьЗаполнение() Тогда
			ВызватьИсключение НСтр("ru = 'Документ не прошёл проверку заполнения.'");
		КонецЕсли;
		
		Документ.Записать(РежимЗаписиДокумента.Проведение);
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
	
	Возврат Документ.Ссылка;
	
КонецФункции

Функция РеквизитыДоговоров(Договоры)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Договоры.Ссылка КАК Договор,
	|	Договоры.Владелец КАК Контрагент,
	|	Договоры.Организация КАК Организация
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов КАК Договоры
	|ГДЕ
	|	Договоры.Ссылка В(&Договоры)";
	Запрос.УстановитьПараметр("Договоры", Договоры);
	
	Результат = Новый Соответствие;
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Результат.Вставить(Выборка.Договор,
			Новый Структура("Контрагент, Организация", Выборка.Контрагент, Выборка.Организация));
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция СуществующиеАкты(Период, Договоры)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Реализации.Договор КАК Договор,
	|	Реализации.Ссылка КАК Реализация
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК Реализации
	|ГДЕ
	|	Реализации.Договор В(&Договоры)
	|	И Реализации.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И НЕ Реализации.ПометкаУдаления";
	Запрос.УстановитьПараметр("Договоры", Договоры);
	Запрос.УстановитьПараметр("НачалоПериода", НачалоМесяца(Период));
	Запрос.УстановитьПараметр("КонецПериода", КонецМесяца(Период));
	
	Результат = Новый Соответствие;
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Результат.Вставить(Выборка.Договор, Выборка.Реализация);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#КонецЕсли
